#========================================================================
def conta(n1,n2):
    p1 = n1
    p2 = n2
    nome()
    soma(p1, p2)
    multi(p1, p2)
    subtracao(p1, p2)

    
#========================================================================
def nome():
    print("Meu nome é Danilo")
    
    
#========================================================================
def soma (n1, n2):
    
    v = n1 + n2
    
    return print('A soma é {}'.format(v))


#========================================================================
def subtracao (n1, n2):
    
    v = n1 - n2
    
    return print('A subtração é {}'.format(v))


#========================================================================
def multi(n1, n2):
        
    m = n1 * n2
    
    return print('A multiplicao é {}'.format(m))
    

#========================================================================
n1 = int(input('Digite um valor: '))
n2 = int(input('Digite o segundo: '))

conta(n1, n2)